/* Тема 01: Числа и строки: операции с ними, ввод и вывод
Урок 4: Hello, friend
Задание 2
Перепишите программу так, чтобы она выводила на экран "Hello, C++!".
*/
#include <iostream>

using namespace std;

int main () {
    cout << "Hello, C++!" << endl;
    return 0;
}