/* Тема 01: Числа и строки: операции с ними, ввод и вывод
Урок 7: Вещественные числа
Задание 5
Напишите программу, которая считывает два double-числа и выводит их частное.
*/

#include <iostream>

using namespace std;

int main() {
    double x, y;
    cin >> x >> y;
    cout << x / y << endl;
} 