/* Тема 01: Числа и строки: операции с ними, ввод и вывод
Урок 4: Hello, friend
Задание 1
Посмотрите на программу “Hello, friend!”. Если вам сложно понять всё, что в ней написано, — не переживайте. 
Вы только начали разбираться в C++. Пока просто посмотрите, как этот язык работает. Нажмите «Проверить».
*/
#include <iostream>

using namespace std;

int main () {
    cout << "Hello, friend!" << endl;
    return 0;
}