/* Тема 01: Числа и строки: операции с ними, ввод и вывод
Урок 6: Целые числа
Задание 3
Время экспериментов. Попробуйте вводить разные числа и другие символы и следите, 
что программа будет выводить в ответ. 
После запуска программа будет ожидать ввода с клавиатуры.
Начните с простого. Напечатайте на клавиатуре, например 555. 
*/

#include <iostream>

using namespace std;

int main() {
	int x;
    cin >> x;
    cout << x << endl;
}